#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/eatthis-ch/eatthis-ch/runs/run-NZFZdR29F7kYVMja

Waiting for the plan to start...

Terraform v1.0.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.digitalocean_kubernetes_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "digitalocean_kubernetes_cluster" "cluster"  {
      + auto_upgrade       = (known after apply)
      + cluster_subnet     = (known after apply)
      + created_at         = (known after apply)
      + endpoint           = (known after apply)
      + id                 = (known after apply)
      + ipv4_address       = (known after apply)
      + kube_config        = (sensitive value)
      + maintenance_policy = (known after apply)
      + name               = "eatthis-ch-doks-prod"
      + node_pool          = (known after apply)
      + region             = (known after apply)
      + service_subnet     = (known after apply)
      + status             = (known after apply)
      + surge_upgrade      = (known after apply)
      + updated_at         = (known after apply)
      + urn                = (known after apply)
      + version            = (known after apply)
      + vpc_uuid           = (known after apply)
    }

  # digitalocean_vpc.k8s will be created
  + resource "digitalocean_vpc" "k8s" {
      + created_at = (known after apply)
      + default    = (known after apply)
      + id         = (known after apply)
      + ip_range   = "10.222.0.0/16"
      + name       = "eatthis-ch-k8s-vpc"
      + region     = "ams2"
      + urn        = (known after apply)
    }

  # module.external_dns.helm_release.external_dns will be created
  + resource "helm_release" "external_dns" {
      + atomic                     = false
      + chart                      = "external-dns"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-dns"
      + namespace                  = "external-dns"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                ## @param sources [array] K8s resources type to be observed for new DNS entries by ExternalDNS
                # Update DNS records from these resources:
                sources:
                  - service
                  - ingress
                
                # Update DNS records with these providers:
                provider: digitalocean
                 
                domainFilters: [eatthis.ch ]
                ## @param triggerLoopOnEvent When enabled, triggers run loop on create/update/delete events in addition to regular interval (optional)
                ##
                triggerLoopOnEvent: true
                ## @param interval Interval update period to use
                ##
                interval: "1m"
                ## @param policy Modify how DNS records are synchronized between sources and providers (options: sync, upsert-only )
                ##
                policy: sync
                ## @param txtPrefix When using the TXT registry, a prefix for ownership records that avoids collision with CNAME entries (optional)<CNAME record> (Mutual exclusive with txt-suffix)
                ##
                txtPrefix: ""
                ## @param txtSuffix When using the TXT registry, a suffix for ownership records that avoids collision with CNAME entries (optional)<CNAME record>.suffix (Mutual exclusive with txt-prefix)
                ##
                txtSuffix: ""
                ## @param txtOwnerId A name that identifies this instance of ExternalDNS. Currently used by registry types: txt & aws-sd (optional)
                ## But other registry types might be added in the future.
                ##
                txtOwnerId: eatthis-ch-doks-prod
                  
                ## Container resource requests and limits
                ## ref: http://kubernetes.io/docs/user-guide/compute-resources/
                ## We usually recommend not to specify default resources and to leave this as a conscious
                ## choice for the user. This also increases chances charts run on environments with little
                ## resources, such as Minikube. If you do want to specify resources, uncomment the following
                ## lines, adjust them as necessary, and remove the curly braces after 'resources:'.
                ## @param resources.limits The resources limits for the container
                ## @param resources.requests The requested resources for the container
                ##
                resources:
                  limits:
                    cpu: 50m
                    memory: 50Mi
                  requests:
                    cpu: 10m
                    memory: 50Mi
                
                
            EOT,
        ]
      + verify                     = false
      + version                    = "5.4.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.external_dns.kubernetes_namespace.external_dns will be created
  + resource "kubernetes_namespace" "external_dns" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "external-dns"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.terraform_digitalocean_doks.digitalocean_kubernetes_cluster.k8s will be created
  + resource "digitalocean_kubernetes_cluster" "k8s" {
      + auto_upgrade   = false
      + cluster_subnet = (known after apply)
      + created_at     = (known after apply)
      + endpoint       = (known after apply)
      + id             = (known after apply)
      + ipv4_address   = (known after apply)
      + kube_config    = (sensitive value)
      + name           = "eatthis-ch-doks-prod"
      + region         = "ams2"
      + service_subnet = (known after apply)
      + status         = (known after apply)
      + surge_upgrade  = true
      + tags           = [
          + "kubernetes",
        ]
      + updated_at     = (known after apply)
      + urn            = (known after apply)
      + version        = "1.21.2-do.2"
      + vpc_uuid       = (known after apply)

      + maintenance_policy {
          + day        = (known after apply)
          + duration   = (known after apply)
          + start_time = (known after apply)
        }

      + node_pool {
          + actual_node_count = (known after apply)
          + auto_scale        = true
          + id                = (known after apply)
          + labels            = {
              + "service" = "kubernetes"
            }
          + max_nodes         = 3
          + min_nodes         = 1
          + name              = "eatthis-ch-doks-prod-core"
          + node_count        = 1
          + nodes             = (known after apply)
          + size              = "s-2vcpu-4gb"
          + tags              = [
              + "kubernetes",
            ]
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.


```
</details>
*Pusher: @the-technat, Action: `pull_request`*